/*
SQLyog Ultimate v12.5.1 (64 bit)
MySQL - 8.0.19 : Database - bhac
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE IF NOT EXISTS `bhac` /*!40100 DEFAULT CHARACTER SET utf8 */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `bhac`;

/*Data for the table `bhac_activity` */

insert  into `bhac_activity`(`id`,`category`,`uid`,`title`,`place`,`ddl`,`begin`,`end`,`brief`,`isOpen`,`limitPeopleNum`,`state`,`extra`) values 
(1,1,3,'北航博雅大讲堂——大学生如何成功创业','主M201','2020-05-13 14:00:00','2020-05-14 19:00:00','2020-05-14 21:00:00','这是一堂讲授创业知识的课。',0,50,1,NULL),
(2,2,3,'用美的声音为您赋能','主M202','2020-05-14 14:00:00','2020-05-15 19:00:00','2020-05-15 21:00:00','讲授声音的技巧，体验声音的魅力。',0,100,1,NULL),
(3,1,3,'2019年秋季学期第四次电子创新大赛培训','主127','2020-06-01 14:00:00','2020-06-16 19:00:00','2020-06-16 21:00:00','这是第四次电子创新大赛培训。',0,-1,1,NULL),
(4,1,3,'知行书院辩论赛','人文大讲堂','2020-06-16 14:00:00','2020-06-17 19:00:00','2020-06-17 21:00:00','这是知行书院辩论赛。',0,200,1,NULL),
(5,3,3,'航天科普志愿行动','中国科学馆1层报告厅','2020-05-30 14:00:00','2020-06-05 19:00:00','2020-06-05 21:00:00','这是航天科普志愿行动。',0,50,1,NULL),
(6,3,3,'航拍中国展览','沙河艺文空间','2020-06-04 14:00:00','2020-06-05 09:00:00','2020-06-20 11:00:00','这是航拍中国展览。',0,-1,1,NULL),
(7,4,3,'无人驾驶行业初探','实4-205','2020-06-10 14:00:00','2020-06-20 19:00:00','2020-06-20 21:00:00','这是无人驾驶行业的初步介绍。',0,150,1,NULL),
(8,6,3,'指挥家于海《我们的祖国》主题讲座','北航沙河校区咏曼剧场','2020-06-20 14:00:00','2020-06-21 19:00:00','2020-06-21 21:00:00','这是指挥家于海《我们的祖国》主题讲座。',0,75,1,NULL),
(9,2,3,'爱情心理学——最美时光遇见你','实4-205','2020-06-05 14:00:00','2020-06-11 16:00:00','2020-06-11 18:00:00','这是爱情心理学——最美时光遇见你。',0,80,1,NULL),
(10,2,3,'雅思考官 & 环球名师，带你玩转口语','沙河校区S4-205','2020-06-01 14:00:00','2020-06-2 19:00:00','2020-06-02 21:00:00','这是雅思考官 & 环球名师，带你玩转口语。',0,90,1,NULL),
(11,3,4,'北京高校书法作品展','沙河艺文空间','2020-06-15 14:00:00','2020-06-16 08:55:00','2020-07-23 10:55:00','这是北京高校书法作品展。',1,-1,1,NULL),
(12,7,4,'“榜样之光”——计算机学院2020年度表彰大会','实4-205','2020-05-21 14:00:00','2020-06-20 16:30:00','2020-06-20 18:30:00','这是“榜样之光”——计算机学院2020年度表彰大会。',0,140,1,NULL),
(13,2,4,'逻辑与人工语言','J3-311','2020-06-24 14:00:00','2020-06-25 14:30:00','2020-06-25 16:30:00','这是逻辑与人工语言。',0,150,1,NULL),
(14,7,4,'“三人行”学术讲座|CV&VR专题','J0-003','2020-06-25 14:00:00','2020-06-26 19:00:00','2020-06-26 21:00:00','这是“三人行”学术讲座|CV&VR专题。',0,185,1,NULL),
(15,4,4,'\"三人行\"学术讲座——大数据','J0-001','2020-06-26 14:00:00','2020-06-27 19:00:00','2020-06-27 21:00:00','这是\"三人行\"学术讲座——大数据。',0,50,1,NULL),
(16,2,4,'相声艺术进校园——曹云金专场','沙河咏曼剧场','2020-06-27 14:00:00','2020-06-28 19:00:00','2020-06-28 21:00:00','这是相声艺术进校园——曹云金专场。',0,60,1,NULL),
(17,2,4,'“青春·奋斗”主题团日活动','沙河咏曼剧场','2020-06-28 14:00:00','2020-06-29 19:15:00','2020-06-29 21:15:00','这是“青春·奋斗”主题团日活动。',0,250,1,NULL),
(18,1,4,'首都百万师生同上一堂课','J0-001、J0-002','2020-06-29 14:00:00','2020-06-30 19:30:00','2020-06-30 21:30:00','这是首都百万师生同上一堂课。',0,250,1,NULL),
(19,5,4,'软件学院专业宣讲暨开放日','沙河咏曼剧场','2020-06-30 14:00:00','2020-06-31 08:30:00','2020-06-31 12:00:00','这是软件学院专业宣讲暨开放日。',0,-1,0,NULL),
(20,5,4,'世界那么大，我想去看看-电子信息工程专业宣讲报告','沙河咏曼剧场','2020-06-31 14:00:00','2020-07-01 09:30:00','2020-07-01 11:30:00','这是世界那么大，我想去看看-电子信息工程专业宣讲报告。',0,240,0,NULL),
(21,5,4,'科幻成真的时代-信息科学技术的发展与未来','实4-205','2020-07-01 14:00:00','2020-07-02 14:00:00','2020-07-02 16:00:00','这是科幻成真的时代-信息科学技术的发展与未来。',0,200,0,NULL);

/*Data for the table `bhac_actuserrole` */

insert  into `bhac_actuserrole`(`id`,`uid`,`rid`) values 
(2,1,2),
(3,1,3),
(4,1,4),
(5,1,5),
(6,1,6),
(7,1,7),
(8,2,1),
(9,2,3),
(10,2,4),
(11,2,6),
(12,2,7),
(22,1,1);

/*Data for the table `bhac_belongactivitytag` */

insert  into `bhac_belongactivitytag`(`id`,`aid`,`tid`) values 
(1,1,1),
(2,2,2),
(3,3,1),
(4,4,1),
(5,5,3),
(6,6,3),
(7,7,4),
(8,8,6),
(9,9,2),
(10,10,2),
(11,11,3),
(12,12,7),
(13,13,2),
(14,14,7),
(15,15,4),
(16,16,2),
(17,17,2),
(18,18,1),
(19,19,5),
(20,20,5),
(21,21,5);

/*Data for the table `bhac_comment` */

insert  into `bhac_comment`(`id`,`pid`,`seqNum`,`postedBy`,`parentId`,`content`,`date`) values 
(1,1,1,1,NULL,'first_comment','2020-04-30 18:06:28'),
(2,2,2,1,NULL,'second_comment','2020-04-30 18:06:28'),
(3,3,3,1,NULL,'third_comment','2020-04-30 18:06:28');

/*Data for the table `bhac_joinuseractivity` */

insert  into `bhac_joinuseractivity`(`id`,`uid`,`aid`,`state`) values 
(1,1,1,0),
(2,1,2,0),
(3,1,3,1),
(4,2,2,1),
(5,2,3,1),
(6,3,3,1);

/*Data for the table `bhac_manageuseractivity` */

insert  into `bhac_manageuseractivity`(`id`,`uid`,`aid`) values 
(1,1,1),
(2,1,2),
(3,1,3),
(4,1,4),
(5,1,5),
(6,1,6),
(7,1,7),
(8,1,8),
(9,1,9),
(10,1,10),
(11,1,11),
(12,1,12),
(13,1,13),
(14,1,14),
(15,1,15),
(16,1,16),
(17,1,17),
(18,1,18),
(19,1,19),
(20,1,20),
(21,1,21),
(22,2,1),
(23,2,2),
(24,2,3),
(25,2,4),
(26,2,5),
(27,2,6),
(28,2,7),
(29,2,8),
(30,2,9),
(31,2,10),
(32,2,11),
(33,2,12),
(34,2,13),
(35,2,14),
(36,2,15),
(37,2,16),
(38,2,17),
(39,2,18),
(40,2,19),
(41,2,20),
(42,2,21),
(43,3,1),
(44,3,2),
(45,3,3),
(46,3,4),
(47,3,5),
(48,3,6),
(49,3,7),
(50,3,8),
(51,3,9),
(52,3,10),
(53,4,11),
(54,4,12),
(55,4,13),
(56,4,14),
(57,4,15),
(58,4,16),
(59,4,17),
(60,4,18),
(61,4,19),
(62,4,20),
(63,4,21);

/*Data for the table `bhac_post` */

insert  into `bhac_post`(`id`,`aid`,`tid`,`title`,`postedBy`,`numOfComment`,`lastEdited`,`type`) values 
(1,1,1,'',1,1,'2020-04-30 17:10:28',0),
(2,1,2,'',1,2,'2020-04-30 17:10:29',0);

/*Data for the table `bhac_role` */

insert  into `bhac_role`(`id`,`tid`,`state`) values 
(1,1,0),
(2,2,0),
(3,3,0),
(4,4,0),
(5,5,0),
(6,6,0),
(7,7,0),
(22,10,0),
(23,11,0);

/*Data for the table `bhac_tag` */

insert  into `bhac_tag`(`id`,`name`,`state`,`parent_id`) values 
(1,'博雅课程-讲座-综合',0,NULL),
(2,'博雅课程-讲座-人文',0,NULL),
(3,'博雅课程-参观',0,NULL),
(4,'博雅课程-讲座-科技',0,NULL),
(5,'博雅课程-讲座-信息',0,NULL),
(6,'博雅课程-讲座-文艺',0,NULL),
(7,'博雅课程-学校/院文化素质教育活动',0,NULL);

/*Data for the table `bhac_user` */

insert  into `bhac_user`(`id`,`username`,`email`,`phoneNum`,`password`,`state`,`firstName`,`lastName`,`studentId`,`avatarUrl`,`gender`) values 
(1,'system1','4646466@qq.com','13886454565','123456',1,'熙悦','郑','17890255',NULL,2),
(2,'manager1','55646456@qq.com','18100011007','123456',0,'立国','许','17896522',NULL,0),
(3,'user1','54547545@qq.com','13456854595','123456',0,'天伟','许','17895685',NULL,0),
(4,'user2','3564744545@qq.com','17548575749','123456',0,'岩','褚','17896523',NULL,0),
(5,'user3','65885455@qq.com','17555421245','123456',0,'长水','李','17892145',NULL,1),
(6,'konata','1096.izumi@kyoto.com', '18974327889','123456',0,'konata','izumi','19290000',NULL,2);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
